terraform/goodbye/tests/load_test.yaml
config:
  target: "{{ $processEnvironment.TARGET }}"
  phases:
    - duration: 1 # test duration (seconds)
      arrivalRate: 3 # requests per second
  defaults:
    headers:
      Authorization: "allow"
scenarios:
  - flow:
      - get:
          url: "/goodbye"
      - log: "Sent GET request to private endpoint (token) `goodbye`"